<a href="https://colab.research.google.com/github/Zernach/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Zernach_Ryan_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img align="left" src="https://lever-client-logos.s3.amazonaws.com/864372b1-534c-480e-acd5-9711f850815c-1524247202159.png" width=200> 


Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

ASSIGNMENT COMPLETED BY: [RYAN ZERNACH](https://ZERNACH.COM/RYAN-ZERNACH)

![alt text](http://www.zernach.com/wp-content/uploads/2019/09/Ryan-Zernach-Logo-1-e1568499634499.png)

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz
%cd instacart_2017_05_01
!ls -lh *.csv

--2019-10-02 19:38:48--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.239.141
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.239.141|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  63.7MB/s    in 3.1s

2019-10-02 19:38:52 (63.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv
/content/instacart_2017_05_01
-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

In [34]:
import pandas as pd

aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

print('aisles = ', aisles.columns.to_list())
print('departments', departments.columns.to_list())
print('order_products_prior = ', order_products__prior.columns.to_list())
print('order_products__train = ', order_products__train.columns.to_list())
print('orders = ', orders.columns.to_list())
print('products = ', products.columns.to_list())

aisles =  ['aisle_id', 'aisle']
departments ['department_id', 'department']
order_products_prior =  ['order_id', 'product_id', 'add_to_cart_order', 'reordered']
order_products__train =  ['order_id', 'product_id', 'add_to_cart_order', 'reordered']
orders =  ['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow', 'order_hour_of_day', 'days_since_prior_order']
products =  ['product_id', 'product_name', 'aisle_id', 'department_id']

In [22]:
pd.options.display.max_columns = 999
print(aisles.head())
print(departments.head())
print(order_products__prior.head())
print(order_products__train.head())
print(orders.head())
print(products.head())

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation
   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol
   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0
   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
   order_id  user_id eval_set  order_number  order_dow  order_hour_of_day  \
0   2539329        1    prior             1          2                  8
1   2398795        1    prior             2          3                  7
2    473747        1    prior             3          3                 12
3   2254736        1    prior             4          4                  7
4    431534        1    prior             5          4                 15

   days_since_prior_order
0                     NaN
1                    15.0
2                    21.0
3                    29.0
4                    28.0
   product_id                                       product_name  aisle_id  \
0           1                         Chocolate Sandwich Cookies        61
1           2                                   All-Seasons Salt       104
2           3               Robust Golden Unsweetened Oolong Tea        94
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...        38
4           5                          Green Chile Anytime Sauce         5

   department_id
0             19
1             13
2              7
3              1
4             13

First, write down which columns you need and which dataframes have them.



*   I NEED THE PRODUCT_ID COLUMN IN BOTH THE ORDER_PRODUCTS__PRIOR AND THE ORDER_PRODUCTS__TRAIN DATASETS

*   I NEED THE PRODUCT_ID COLUMN AND THE PRODUCT_NAME COLUMN FROM THE PRODUCTS DATASET, IN ORDER TO DECIPHER THE PRODUCT_ID'S FROM THE ORDERS_PRODUCTS__TRAIN/PRIOR DATASETS



Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [33]:
order_products = pd.concat([order_products__prior, order_products__train])
order_products.drop(columns=['order_id', 'add_to_cart_order', 'reordered'], axis=1)
order_products['product_id'].value_counts().sort_values(ascending=False).head(10)

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [31]:
print(products['product_name'][24851], 'was ordered 491,291 times.')
print(products['product_name'][13175], 'was ordered 394,930 times.')
print(products['product_name'][21136], 'was ordered 275,577 times.')
print(products['product_name'][21902], 'was ordered 251,705 times.')
print(products['product_name'][47208], 'was ordered 220,877 times.')
print(products['product_name'][47765], 'was ordered 184,224 times.')
print(products['product_name'][47625], 'was ordered 160,792 times.')
print(products['product_name'][16796], 'was ordered 149,445 times.')
print(products['product_name'][26208], 'was ordered 146,660 times.')
print(products['product_name'][27844], 'was ordered 142,813 times.')

Banana was ordered 491,291 times.
Bag of Organic Bananas was ordered 394,930 times.
Organic Strawberries was ordered 275,577 times.
Organic Baby Spinach was ordered 251,705 times.
Organic Hass Avocado was ordered 220,877 times.
Organic Avocado was ordered 184,224 times.
Large Lemon was ordered 160,792 times.
Strawberries was ordered 149,445 times.
Limes was ordered 146,660 times.
Organic Whole Milk was ordered 142,813 times.

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

#Table_2 --> Tidy
##(I left it labeled as table_2, but I showed my work)

In [107]:
%matplotlib inline

import pandas as pd
import numpy as np
import seaborn as sns

table_2 = pd.DataFrame([[np.nan, 2], [16, 11], [3, 1]],
                       index = ['John', 'Jane', 'Mary'],
                       columns = ['treatmenta', 'treatmentb']).reset_index()

table_2

  index  treatmenta  treatmentb
0  John         NaN           2
1  Jane        16.0          11
2  Mary         3.0           1

In [108]:
table_2 = table_2.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

table_2

  index    variable  value
0  John  treatmenta    NaN
1  Jane  treatmenta   16.0
2  Mary  treatmenta    3.0
3  John  treatmentb    2.0
4  Jane  treatmentb   11.0
5  Mary  treatmentb    1.0

In [109]:
table_2 = table_2.rename(columns = {'index':'name', 'variable':'treatment', 'value':'result'})

table_2

   name   treatment  result
0  John  treatmenta     NaN
1  Jane  treatmenta    16.0
2  Mary  treatmenta     3.0
3  John  treatmentb     2.0
4  Jane  treatmentb    11.0
5  Mary  treatmentb     1.0

In [110]:
### WHY WON'T MY COMMENTED OUT CODE WORK FOR THIS?

#def strip_treatment_LOL(the_string):
#  return the_string.strip("treatment")

#table_2['treatment'] = table_2['treatment'].apply(strip_treatment_LOL)

table_2['treatment'] = table_2['treatment'].str.replace('treatment', '')

table_2

   name treatment  result
0  John         a     NaN
1  Jane         a    16.0
2  Mary         a     3.0
3  John         b     2.0
4  Jane         b    11.0
5  Mary         b     1.0

#Tidy --> Table_2
##(I left it labeled as table_2, but showed my work)

In [111]:
wide = table_2.pivot_table(index='name', columns='treatment', values='result')
wide

treatment     a     b
name
Jane       16.0  11.0
John        NaN   2.0
Mary        3.0   1.0

#Flights

In [88]:
flights = sns.load_dataset('flights')
print(flights.shape)
flights.head()

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [89]:
flights.pivot_table(index='year', columns='month', values='passengers')

month,January,February,March,April,May,June,July,August,September,October,November,December
year,,,,,,,,,,,,
1949,112,118,132,129,121,135,148,148,136,119,104,118
1950,115,126,141,135,125,149,170,170,158,133,114,140
1951,145,150,178,163,172,178,199,199,184,162,146,166
1952,171,180,193,181,183,218,230,242,209,191,172,194
1953,196,196,236,235,229,243,264,272,237,211,180,201
1954,204,188,235,227,234,264,302,293,259,229,203,229
1955,242,233,267,269,270,315,364,347,312,274,237,278
1956,284,277,317,313,318,374,413,405,355,306,271,306
1957,315,301,356,348,355,422,465,467,404,347,305,336
1958,340,318,362,348,363,435,491,505,404,359,310,337
1959,360,342,406,396,420,472,548,559,463,407,362,405
1960,417,391,419,461,472,535,622,606,508,461,390,432

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####